Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །མགོན་པོ་ཆུ་བོ་དག་ལས་འཇིག་རྟེན་སྒྲོལ།
en: “Ferry the beings, O lord, across the sea of suffering!

source: །འདི་དག་ཡན་ལག་བརྒྱད་ཀྱིས་ཆུ་ཡིས་ཁྲུས།
en: Wash them with the water possessed of the eight qualities!

source: །མགོན་པོ་མཆོག་རབ་ཁྱོད་དང་འདྲ་བ་ནི། །འཇིག་རྟེན་གསུམ་པོ་འདི་ན་འགའ་མ་མཆིས།
en: There is no being in the threefold universe Who could be as eminent as you, O lord.

source: །བདག་གྲོལ་འཇིག་རྟེན་འདི་དག་གྲོལ་བར་མཛད།
en: “Liberated yourself, may you liberate the world as well!

source: །སྲིད་གསུམ་རྒྱ་མཚོ་ལས་ཀྱང་འགྲོ་བ་སྒྲོལ།
en: Save the world from the ocean of the three realms,

source: །ཁྱོད་ནི་སངས་རྒྱས་འགྲོ་བའི་རྩ་ལག་གཅིག །རྟག་ཏུ་བཞུགས་ཤིང་ཆོས་ནི་བཤད་དུ་གསོལ།
en: For you are a buddha, and the sole kinsman of the world. Remain forever and share the Dharma with others.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྒོ་ཁང་ནས་གཤེགས་པ་དང་། སྐད་ཅིག་དེ་ཉིད་ལ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ནམ་མཁའ་ལ་རྒྱུ་ཞིང་གདོང་མཆི་མ་ཅན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The Blessed One, however, proceeded farther along the gate passage. At that moment many hundreds of thousands of millions of billions of gods, nāgas, yakṣas, and rākṣasas, their faces bathed in tears, flew through the sky, imploring him:

source: །བདག་ཅག་རྣམས་ཀྱིས་བདེ་གཤེགས་སྔོན་མཐོང་བ།
en: “First, during the time of peace, we saw blissful ones

source: །ཞི་བའི་དུས་ལ་ཤིན་ཏུ་སློབ་མ་དུལ།
en: Who trained their students well,

source: །ཆོས་རྣམས་རྒྱ་ཆེར་སྟོན་པ་མཛད་པ་ན།
en: Instructing them in the Dharma in full

source: །དེ་ལ་དེ་ལྟ་བུ་ཡི་བགེགས་མ་བྱུང་།
en: Without being blocked in the manner it is happening now.

source: །སྟོན་པ་འདི་ནི་ཤིན་ཏུ་དུས་ངན་ལ།
en: “This teacher, one of great intelligence,

source: །རྒྱ་ཆེན་བློ་ཡིས་རང་བྱུང་ཉིད་བརྙེས་ཏེ། །ཐུབ་དབང་འགྲོ་བ་ཡོངས་སྨིན་མཛད་སླད་དུ།
en: Has attained the self-arisen state during the degenerate period.

source: །འཇིག་རྟེན་ཉོན་མོངས་བསྒྲིབས་ལ་ཆོས་སྟོན་ཅིང་།
en: He, the lord of sages, has taught the Dharma in this world, Which is obscured by the afflictions, for the sake of bringing beings to maturity.

source: །སྨྲ་བའི་སེང་གེ་འདི་ན་བཞུགས་བཞིན་དུ།
en: “While this leonine speaker remains here,

source: །སྡིག་ཅན་དག་ནི་བྱེ་བ་སྟོང་མང་པོ།
en: One billion evil ones

source: །དེ་ལྟར་ཆོས་རྣམས་རབ་ཏུ་འཇིག་པར་བགྱིད།
en: Are bringing ruin upon the Dharma.

source: །སངས་རྒྱས་དཔའ་བོ་གྲོང་དུ་དེང་མ་གཤེགས།
en: Do not enter the city today, O valiant Buddha!”

source: །དེ་ནས་ལྷ་མོ་གཞན་ཞིག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Another goddess warned:

source: །སྔོན་གྱི་རྒྱལ་བ་འཇིག་རྟེན་ཕན་བརྩོན་པ།
en: “The former victors, engaged for the sake of the world’s welfare,

source: །དེ་དག་ཡུལ་ཅིག་འཁོར་ལོ་བསྐོར་གྱུར་པ།
en: Turned the wheel of the Dharma in just one place.

source: །འདི་ནི་གང་དུ་གཤེགས་པ་དེར་ཡང་བསྐོར།
en: This one, however, preaches wherever he travels.

source: །དེ་རིང་མ་རུང་བར་ནི་གྱུར་ཏ་རེ།
en: There is a risk that calamity will befall him in such places!”

source: །དེ་ནས་ཡང་ལྷ་མོ་གཞན་ཞིག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Another goddess said:

source: །དེད་དཔོན་འདིར་ནི་ཐུགས་རྗེའི་སླད།
en: “This leader, out of compassion, has wandered around

source: །ཤིན་ཏུ་སེམས་ཅན་དོན་མཛད་སྤྱད།
en: And has benefited beings in great measure.

source: །དེ་ནི་དེ་རིང་གྲོང་ཁྱེར་འདིར།
en: My only concern, however, is that today

source: །བརླག་པར་འགྱུར་སྙམ་བདག་རྟོག་གོ།
en: He might perish in this city.”

source: །ཡང་དེའི་ཚེ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གདོང་ལ་མཆི་མ་ཟག་ཅིང་ངོམ་ཟུང་གནག་པ་དག་ནམ་མཁའི་ངོས་ཀྱི་ལམ་ལས་བབས་ཏེ།
en: Under these circumstances, many hundreds of thousands of millions of billions of gods, nāgas, yakṣas, rākṣasas, asuras, garuḍas, kinnaras, and mahoragas descended from the sky above with forlorn expressions on their tear-soaked faces.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་ནས་བདག་ཉིད་ལ་རྣམ་པ་མང་པོ་བྱེད་དེ།
en: Arraying themselves before the Blessed One, they acted in many different, self-harming ways.

source: ལ་ལ་ནི་སྐྲ་འབལ།
en: Some pulled out their hair.

source: ལ་ལ་ནི་རྒྱན་འགྲོལ།
en: Some cast off their adornments.

source: ལ་ལ་ནི་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་སྙོལ།
en: Some threw away their parasols, banners, and flags.

source: ལ་ལ་ནི་བདག་ཉིད་ཀྱི་ལུས་ས་ལ་རྡོབ།
en: Some threw themselves on the ground.

source: ལ་ལ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་འཛིན།
en: Some took hold of the Blessed One’s feet.

source: ལ་ལ་ནི་ཤིན་ཏུ་ཉོན་མོངས་པར་ངུ་།
en: Some wailed most piteously.

source: ལ་ལ་ནི་ལག་པས་བྲང་རྡུང་།
en: Some beat their breasts with their hands.

source: ལ་ལ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་དྲུང་ན་འདུག་ཅིང་སོ་བྱ་བཞིན་དུ་འགྲེ་ལྡོག །ལ་ལ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ཏེ་བསྟོད་ཅིང་ཕྱག་འཚལ་བར་བྱེད།
en: Some, standing at the Blessed One’s feet, spun in circles like the madgu bird. Some, standing in front of the Blessed One with folded hands, bowed to him and recited praises.

source: ལ་ལ་ནི་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། གོས་དང་། ཕྱང་འཕྲུལ་དང་། གསེར་གྱི་སྐུད་པ་དང་། མུ་ཏིག་གི་ཕྲེང་བ་དང་། རས་བཅོས་བུ་དག་མངོན་པར་འཐོར་རོ།
en: And some showered upon him flowers, incense, perfume, garlands, scented oils, clothes, adornments, golden thread, strings of pearls, and fine cloth.

source: །དེ་ནས་ལྷ་གཞན་བྱེ་བ་མང་པོས་མགྲིན་གཅིག་ཏུ་སྐད་མཐོན་པོར་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Some others, numbering tens of millions, chanted the following in a single loud voice: “You have practiced many austerities

source: །འཇིག་རྟེན་དོན་སླད་འདི་བས་མང་བ་ཡི། །བྱ་བར་དཀའ་བ་ཁྱོད་ཀྱིས་རབ་ཏུ་སྤྱད།
en: For the great benefit of the world.

source: །ཟད་པའི་དུས་དེང་འདིར་ནི་ཁྱོད་སྐྱེས་ཀྱིས།
en: Now that your time here is limited,

source: །བཏང་སྙོམས་མཛོད་ལ་མི་གཤེགས་བཞུགས་སུ་གསོལ།
en: Please be equanimous. Don’t leave!

source: །སྡིག་མེད་ཁྱོད་ཀྱིས་སངས་རྒྱས་མཛད་པ་ཉུང་ངུ་མཛད།
en: “Your buddha activity, O faultless one, has been accomplished only in part.

source: །ལྷ་དང་མི་རྣམས་དབང་དུ་མཛད་པ་ཤིན་ཏུ་ཉུང་།
en: Only a few gods and humans have been called to witness you.

source: །ཤིན་ཏུ་ཡུན་རིང་ཆོས་རྣམས་སྟོན་ཅིང་ཁྱོད་བཞུགས་ལ།
en: You should remain, teaching the Dharma for a long time to come,

source: །སྲིད་པ་གསུམ་གྱི་རྒྱ་མཚོ་འདི་ལས་འགྲོ་བ་སྒྲོལ།
en: Thus delivering beings from the ocean of the threefold existence. “There are many beings practicing good conduct.

source: །དགེ་བའི་ལས་རྣམས་བགྱིད་ཅིང་ས་བོན་ཡོངས་སྨིན་ཏེ། །བདུད་རྩིའི་སྣོད་དུ་གྱུར་པའི་སེམས་ཅན་དུ་མ་ལ།
en: With their good seeds ripening, they have become vessels for the elixir of the Dharma.

source: །ཁྱོད་ཀྱི་ཐུགས་རྗེ་བསྐྱེད་དེ་སོ་སོར་རབ་སྟོན་ལ།
en: You should feel compassion for them and teach them the meaning.

source: །ཆུ་བོ་ལས་ནི་འཇིག་རྟེན་ཉམ་ཐག་བསྒྲལ་བར་མཛོད།
en: You should deliver the pitiful world from the river of suffering. “You should show the right path

source: །འགྲོ་བ་དགོན་པའི་དབུས་སོང་འཁྱམས་གྱུར་ཅིང་།
en: To those who have lost their way in the wilderness of saṃsāra

source: །འཁོར་བའི་དགོན་པར་ཤིན་ཏུ་ལམ་སྟོར་བ།
en: And have strayed into the thick forest of various destinies.

source: །དེ་དག་ལ་ནི་ལམ་མཆོག་སོ་སོར་སྟོན། །འཕགས་པའི་ཆོས་མཆོག་ཚིག་གིས་ཐར་བར་མཛོད།
en: You should deliver them with words of the supreme noble Dharma. “Your most marvelous and wonderful act of compassion

source: །ཆོས་ཀྱི་འཁོར་ལོ་དམ་པ་གང་བསྐོར་བ། །དེ་ནི་ཁྱོད་ཀྱི་ཐུགས་རྗེ་ངོ་མཚར་རྨད།
en: Was the turning of the wheel of the sublime Dharma.

source: །རླབས་ཆེན་ཐུགས་མངའ་རིང་དུ་བཞུགས་སུ་གསོལ།
en: Please remain for a long time, O most intelligent one!

source: །འགྲོ་བ་རྣམས་ནི་མགོན་མེད་མ་གྱུར་ཅིག །དེ་ནས་ཡང་ལྷ་མོ་གཞན་ཞིག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Let humankind not be deprived of a protector!” Another goddess said:

source: །རྣམ་འདྲེན་བརྒྱ་ལ་མ་རུང་གྱུར་ན་ནི།
en: “Should the Guide perish,

source: །འཇིག་རྟེན་འདི་ལྟར་མ་ལུས་ལྡོངས་པར་འགྱུར།
en: The entire world will be rendered blind.

source: །ཡན་ལག་བརྒྱད་ལམ་རྣམ་ཐར་གསུམ་གྱི་རྒྱུ།
en: The eightfold path—the cause of the threefold liberation—

source: །འདིར་ནི་ཡོང་ཡེ་ཐམས་ཅད་མ་མཆིས་འགྱུར།
en: Will not exist in this world in any way whatsoever. “We have carefully planted virtuous seeds

source: །ངག་ལུས་སེམས་ལས་སྐྱེས་དགེ་ས་བོན་དག །བདག་ཅག་བག་ཡོད་གྱུར་པས་འདིར་བཏབ་སྟེ།
en: Sprung from body, speech, and mind,

source: །དེ་སླད་བདག་ཅག་བདེ་བ་ཀུན་དང་ལྡན།
en: And are thus now surrounded by every type of comfort.

source: །བསོད་ནམས་འབྱུང་གནས་འདིར་བརླག་མ་གྱུར་ཅིག །ཡང་དེའི་ཚེ་གནས་གཙང་མའི་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་དག་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ།
en: May this spring of merit not be lost!” Now many hundreds of thousands of millions of billions of gods from the Pure Abode gathered together and said:

source: དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Do not fret! The Sage, one of vast intellect, Will not come to grief of any kind,

source: །ས་འདིར་བྱེ་བའི་བདུད་རྣམས་ཉེར་ལྷགས་ཀྱང་།
en: Even though tens of millions of māras have arrived on earth

source: །ཐུབ་པ་རླབས་ཆེན་ཐུགས་མངའ་ནམ་ཡང་ནི། །མ་རུང་མི་འགྱུར་ཁྱེད་ཅག་མ་འཇིགས་ཤིག །དགེ་བ་འདི་ལ་བདག་ཅག་མངོན་སུམ་གྱུར།
en: This virtue is clearly evident to us.

source: །དཔག་ཚད་སུམ་ཅུ་དྲུག་ཏུ་མགྱོགས་ཤིང་དྲག་ཤུལ་ལྡན་པས་ཀུན་ཏུ་བསྐོར།
en: “The terrifying army of Māra has battalions stretching all around for thirty-six leagues, primed to move swiftly and with devastating force,

source: །སྣ་བགྲང་རལ་གྲི་མཚོན་རྣོན་རྩུབ་པའི་སྒྲ་མང་འཇིགས་པ་བདུད་ཀྱི་སྡེ།
en: Armed with barbed missiles, scimitars, and enormous swords, and making a lot of raucous sounds.

source: །བྱང་ཆུབ་སྙིང་པོར་ལྷགས་པ་དེའི་ཚེ་དེ་དག་འཇིགས་ཤིང་བརླག་གྱུར་ན།
en: Having now advanced as far as the seat of awakening, it has now approached its own demise.

source: །ད་ལྟར་དོན་བརྙེས་གྲགས་པས་ཁྱབ་པ་དེ་ལ་ག་ལ་བགེགས་ཤིག་བྱེད།
en: Today it will instantly become terrified of Siddhartha; how then could it create obstacles for the one whose fame has spread far and wide?”

source: །དེ་ནས་ལྷ་མོ་གཞན་ཞིག་ངུ་ཞིང་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Another goddess said in tears:

source: །སྔོན་བྱུང་བ་ནི་བདུད་ཀྱི་སྡེ་གཅིག་ཡིན་ཏེ་དེ་དག་དཔུང་མི་ཆེ།
en: “This army consisted in the past of a single māra and wasn’t very strong.

source: །འདི་ནི་བྱེ་བ་ཁྲག་ཁྲིག་བདུད་ཀྱི་སྡེ་སྟེ་ཤིན་ཏུ་དཔུང་ཆེ་བས།
en: But now, tens of thousands of millions of māras strong, it is very powerful.

source: །འཇིག་རྟེན་རྣམ་པར་འདྲེན་པ་འདི་ནི་བརླག་པར་འགྱུར་དུ་རབ་ཏུ་དོགས།
en: I fear that the leader of the world will meet his doom,

source: །དེ་བརླག་ན་ནི་འཇིག་རྟེན་འདི་དག་ཤིན་ཏུ་སྣང་མེད་འཁྱམ་པར་འོང་།
en: And that after his demise, this world will spiral into darkness.”

source: །དེ་ནས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་འཇུས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then Śakra, Brahmā , and the world protectors clasped the feet of the Blessed One and pleaded: “Remain here, O holy one! Please follow the advice, O champion of compassion,

source: །བློ་ཞན་བདག་ཅག་གི་ནི་ཚིག་གསོན་ཏེ། །དགེ་བ་བཞུགས་ཤིང་གཙོ་བོ་ཐུགས་རྗེ་ཅན།
en: Of the two of us, inferior to you in intelligence.

source: །ལྷ་མང་བྱེ་བ་མྱ་ངན་ཆེན་པོས་གདུངས།
en: Many tens of millions of gods are afflicted with profound anguish.

source: །དེ་ལ་ཆོས་ཀྱི་བཅུད་ཀྱིས་ད་གཏོར་ཅིག །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ལ་བྱམས་པ་ཡངས་པའི་སྤྱན་གྱིས་གཟིགས་ནས།
en: Please besprinkle them now with the nectar of Dharma!”

source: དེ་དག་ཤིན་ཏུ་དབུགས་དབྱུང་བའི་ཕྱིར་ཚངས་པའི་དབྱངས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One then looked at the entire congregation, eyes wide with loving kindness, and uttered the following words to comfort them, his voice as sweet as Brahmā ’s:

source: །དེང་ཁྱེད་མ་འཇིགས་ཁྱེད་ནི་མ་སྐྲག་ཤིག །བདུད་རྣམས་ཐམས་ཅད་བཞོན་བཅས་གཅིག་ཆར་དུ།
en: “Don’t fret! You must not be afraid now! Not even all the māras together, riding upon their mounts,

source: །ཚོགས་ཀྱང་སྤུ་གཅིག་སྐྲག་པར་མི་ནུས་ན།
en: The whole lot of them, would be able to trouble

source: །ང་ཡི་ལུས་ཀུན་ལ་ནི་སྨོས་ཅི་དགོས།
en: A single hair of mine, let alone my whole body.

source: །དེང་ནི་འཇིག་རྟེན་ཐམས་ཅད་དབུགས་ཕྱུང་སྟེ།
en: “I will console the entire world today

source: །ང་ཡིས་རྟག་ཏུ་ས་འདིར་ཆོས་བཤད་དོ།
en: And will always teach the Dharma on this earth

source: །ལམ་རྣམས་སྟོར་བ་ལ་ནི་ང་ཉིད་ཀྱིས།
en: To those who have lost their way,

source: །དྲི་མ་མེད་པ་ཡང་དག་ལམ་བསྟན་བྱ།
en: I will duly divulge it with lucid instructions.

source: །ངས་སྔོན་བྱ་བ་དཀའ་བ་མང་པོ་བྱས།
en: “In the past I performed many difficult austerities

source: །ཟས་དང་སྐོམ་ཡང་ཤིན་ཏུ་རྒྱ་ཆེར་བྱིན།
en: And distributed food and drink in abundance,

source: །གནས་དང་སྨན་ཡང་མི་ཉུང་སྦྱིན་བྱིན་པས།
en: As well as many houses and much medicine.

source: །ང་ལ་དེང་སུ་གནོད་པར་བྱེད་པར་ནུས།
en: Who would be able to harm me today?

source: །ངས་ནི་རྟ་དང་གླང་ཆེན་ཤིང་རྟ་དང་། །ལྷབ་ལྷུབ་ཕྱང་འཕྲུལ་དག་གི་རྒྱན་རྣམས་དང་། །བྲན་ཕོ་བྲན་མོ་གྲོང་རྡལ་ཡུལ་འཁོར་བཏང་།
en: “I gave away horses, chariots, and elephants; So also ornaments and adornments, Female and male servants, cities and kingdoms.

source: །ང་ལ་སུ་ཞིག་གནོད་པར་བྱེད་པར་ནུས།
en: Who would be able to harm me today? “For the benefit of beings I gave away

source: །ཆུང་མ་བུ་ཕོ་བུ་མོ་བྲན་མང་དང་། །ཡིད་འོང་དབང་ཕྱུག་ས་སྟེང་རྒྱལ་པོའི་རིགས། །སེམས་ཅན་རྣམས་ལ་ཕན་ཕྱིར་ངས་བྱིན་རློབ།
en: My wives, sons, daughters, and other family members, As well as the royal power desired on earth and my royal lineage.

source: །ང་ལུས་དེ་རིང་ཅི་ཕྱིར་འཇིག་པར་འགྱུར།
en: How then could my body be destroyed today?

source: །མགོ་དང་སྣ་དང་རྣ་བ་མིག་གཉིས་དང་། །ལུས་དང་པགས་པ་ཁྲག་དང་རྐང་ལག་བཅས།
en: “I gave my head, both my eyes, ears, nose, Hands and feet, flesh, skin, and blood.

source: །ང་ཡི་སྲོག་ཀྱང་ལུས་ཅན་རྣམས་ལ་བཏང་།
en: I even gave my own life for the embodied beings in this world.

source: །སུ་ཞིག་ང་ལ་འཚེ་བར་བྱེད་པར་ནུས།
en: Who, then, would be able to hurt me?

source: །ངས་ནི་སངས་རྒྱས་བྱེ་བ་རབ་མང་ལ།
en: “With my own hands, I presented huge offerings to many

source: །གུས་ལྡན་བདག་གི་ལག་ནས་ཤིན་ཏུ་མཆོད།
en: Tens of millions of buddhas, worshiping them with devotion.

source: །རྟག་ཏུ་ཚུལ་ཁྲིམས་ཐོས་དང་བཟོད་ལ་དགའ།
en: I always delighted in practicing discipline , study, and acceptance.

source: །ང་ལ་སུ་ཞིག་རླག་པར་བྱེད་པར་ནུས།
en: Who, then, would be able to injure me today?

source: །ངས་སྔོན་ཤིན་ཏུ་བྱ་དཀའ་མང་པོ་རྣམས།
en: “I formerly practiced difficult austerities

source: །མཉམ་པར་བཞག་པས་རབ་ཏུ་ང་ཡིས་བྱས།
en: With my mind completely focused in absorption.

source: །ལུས་ཀུན་བཅད་ཀྱང་ང་ལ་འཁྲུག་མེད་ན།
en: If there was no anger in my mind even when my body was being butchered,

source: །ང་ལ་རྣམ་པར་འཚེ་བ་སུ་ཞིག་ནུས།
en: Who would be able to hurt me today?

source: །ཉོན་མོངས་ངས་བཏུལ་ངེས་པར་ང་སངས་རྒྱས།
en: “With my afflictions pacified, I am a fully self-controlled buddha

source: །སེམས་ཅན་ཐམས་ཅད་ལ་ནི་བྱམས་སེམས་ལྡན།
en: With my mind full of love for all beings.

source: །ཁྲོ་མེད་ཕྲག་དོག་ཐ་བ་ང་ལ་མེད།
en: I have no envy, harshness, or anger.

source: །ང་ཡི་མདུན་ན་དེ་རིང་སུ་ཞིག་ནུས།
en: No one will be able to stand in my way today.

source: །ངས་ནི་བདུད་ཀྱི་དཔུང་རྣམས་ཚོགས་པ་བཏུལ།
en: “I have gained victory over the entire army of Māra

source: །ངས་ནི་བདུད་མང་བྱེ་བ་ཕམ་པར་བྱས།
en: And defeated many tens of millions of māras.

source: །ཁྱེད་ཀུན་རྣམ་པར་ཐར་པར་ངེས་པར་བྱ།
en: I will definitely liberate you from saṃsāra,

source: །གྲོང་དུ་ཅི་ཕྱིར་མི་འགྲོ་མ་འཇིགས་ཤིག །སེམས་ཅན་དོན་ཕྱིར་ཕྱོགས་བཅུ་འདི་དག་ན།
en: So don’t be afraid. Why would I not enter the city? “Any buddhas dwelling, for the sake of beings, In the ten directions,

source: །སངས་རྒྱས་ལ་ལ་གང་དག་བཞུགས་པ་རྣམས།
en: I will engage them here,

source: །སངས་རྒྱས་ཀུན་དང་བྱང་ཆུབ་སེམས་དཔའ་ཡང་། །རྫུ་འཕྲུལ་ཆེན་པོ་རྣམས་ནི་ཀུན་ན་བསོགས།
en: Along with the bodhisattvas with great magical powers.

source: །ཞིང་རྣམས་མཐའ་དག་རབ་ཏུ་གང་བར་བྱ།
en: “I will completely fill all the buddha fields.

source: །བསོད་ནམས་ཡེ་ཤེས་དག་གིས་གནས་པར་བྱ།
en: There, I will institute merit and wisdom.

source: །སངས་རྒྱས་དེ་དག་ཚུལ་བཅས་ཀུན་གནས་པས།
en: And when those buddhas are properly abiding,

source: །སངས་རྒྱས་དག་གི་དགོངས་པའི་མཛད་པ་བྱ།
en: I will fulfill the intentions of the buddhas.

source: །ཡང་དེའི་ཚེ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ངོ་མཚར་རྨད་དུ་བྱུང་བའི་གྲངས་མེད་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ལ་ཕྱག་འཚལ་ལོ། །ངོ་མཚར་ཆེན་པོ་རྨད་དུ་བྱུང་བ་གྲངས་མེད་པའི་བརྩོན་འགྲུས་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ལོ་ཕྱག་འཚལ་ལོ།
en: On that occasion, infinite and innumerable hundreds of thousands of millions of billions of gods, nāgas, yakṣas, rākṣasas, asuras, garuḍas, kinnaras, mahoragas, and human and nonhuman beings applauded the Blessed One by exclaiming, “Homage to the one endowed with infinite diligence who has the power to work miracles and wonders!

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དབུགས་ཕྱུང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་ཀྱི་ཕྱོགས་ཕམ་པར་མཛད་དོ།
en: Homage, homage to the Blessed Buddha who is thus endowed! The world and its gods have been comforted by the Blessed One, and the followers of Māra defeated.

source: །སེམས་ཅན་རྣམས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པའི་རྙོག་པ་བསལ་ཏོ། །སེམས་ཅན་རྣམས་ཀྱི་ང་རྒྱལ་གྱི་རི་རབ་ཏུ་བསྙིལ་ཏོ།
en: The filth of the afflictions that bind beings to existence has been dispelled. The mountain of their arrogance has been split asunder.

source: །སྐྱེ་བའི་ཤིང་ལྗོན་པ་བཅད་དོ། །འཆི་བདག་གི་ཉི་མ་ཕྱེ་མར་བརླགས་སོ། །མ་རིག་པའི་མུན་པ་བསལ་ཏོ། །གཞན་མུ་སྟེགས་ཅན་རབ་ཏུ་དད་པར་བསྒྱུར་ཏོ། །ཆུ་བོ་བཞི་སྐམས་སོ།
en: The tree of birth has been cut down, the sun of death turned to powder, the darkness of ignorance dispelled, the followers of other religions brought to have faith, the four rivers dried up, the torch of the Dharma lit, and the path to awakening shown.

source: །ཆོས་ཀྱི་སྒྲོན་མ་རབ་ཏུ་འབར་བར་མཛད་དོ། །བྱང་ཆུབ་ཀྱི་ལམ་སྟོན་ཏོ། །བཟོད་པ་དང་དེས་པ་ལ་བཙུད་དོ། །བསམ་གཏན་གྱི་བདེ་བ་ལ་རྩེར་སྩལ་ཏོ། །འཕགས་པའི་བདེན་པ་བཞི་ཁོང་དུ་ཆུད་པར་མཛད་དོ།
en: “Beings have been established in acceptance and gentleness, caused to playfully abide in the bliss of meditation, and made to realize the four truths of the noble ones.

source: །སྟོན་པ་བཅོམ་ལྡན་འདས་ཐུགས་རྗེ་ཆེན་པོ་མངའ་བས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་སྐྱེ་བའི་རྒྱ་མཚོ་ལས་བསྒྲལ་ཏོ།
en: The world and its gods have been ferried across the ocean of births by the most compassionate, blessed teacher.

source: །སེམས་ཅན་རྣམས་འཇིགས་པ་མ་མཆིས་པའི་གྲོང་ཁྱེར་དུ་རབ་ཏུ་བཙུད་དོ།
en: Sentient beings have been transported to the city of fearlessness.”

source: །དེ་ནས་ལྷ་དང་མི་དེ་དག་གིས་བདུག་པ་དང་། མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ལྷབ་ལྷུབ་དང་། རྒྱན་སྣ་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་མཆོད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་ལམ་དེ་ཕྱག་དར་བྱས་སོ། །ལྷའི་གོས་དང་། མེ་ཏོག་དང་། ལྷའི་རས་བཅོས་བུས་ཀུན་ཏུ་གཡོགས་སོ།
en: Then the gods and humans worshiped the Blessed One with sundry flowers, incense, perfume, garlands, ornaments, and adornments and swept the road for his sake.

source: །ལྷའི་མེ་ཏོག་མན་དར་བ་དང་། མན་དར་བ་ཆེན་པོ་དང་། བ་རུ་ཤ་ཀ་དང་། བ་རུ་ཤ་ཀ་ཆེན་པོ་དང་། མཉྫུ་ཤ་ཀ་དང་། མཉྫུ་ཤ་ཀ་ཆེན་པོ་དང་། མདོག་མཛེས་དང་། མདོག་མཛེས་ཆེན་པོ་དང་། ཨུད་པ་ལ་དང་། ཀུ་མུ་ད་དང་། པད་མས་ཀུན་ཏུ་གཡོགས་སོ།
en: They covered it in celestial cloth, calico, and flowers, including celestial flowers such as mandārava and great mandārava, pāruṣaka and great pāruṣaka, mañjuṣaka and great mañjuṣaka, and roca and great roca, as well as blue, red, and white lotus flowers.

source: །གང་དུ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་འདོར་བའི་ལམ་དེའི་ངོས་གཉིས་སུ་ལྷའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ལྗོན་པ་མངོན་པར་སྤྲུལ་ཏེ། ལྷའི་རས་བཅོས་བུ་དང་། མུ་ཏིག་གི་ཕྲེང་བ་དང་། ལག་རྒྱན་དང་། རྣ་རྒྱན་དང་། མགོའི་རྒྱན་གྱིས་རབ་ཏུ་བརྒྱན་ཏོ།
en: In the places where the Blessed One would put his feet on the road, they conjured up, on either side, trees made of the seven precious gems, and adorned them with celestial cloth, calico, and hand, ear, and head adornments.

source: །ཤིང་དེ་དག་གི་བར་བར་དུ་ལྷའི་རྫིང་བུ་གྲང་ཞིང་ཞིམ་པའི་ཆུ་དང་ཞིང་རྙོག་པ་མེད་ལ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཀུན་ཏུ་གང་བ་ཁོ་ར་ཁོར་ཡུག་ཏུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་དག་སྤྲུལ་ཏེ།
en: Between the trees, they conjured up celestial lotus ponds with cool and sweet water, completely limpid and free of turbidity. These were filled with water possessing eight qualities and adorned all around with the seven precious gems.

source: བར་སྣང་ལ་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། གསེར་གྱི་སྐུད་པ་དང་། མུ་ཏིག་གི་ཕྲེང་བ་བཟུང་ཞིང་གསེར་གྱི་ཕྱེ་མ་དག་གི་ཆར་ཡང་ཕབ་བོ།
en: In the space above, they held up parasols made from the seven precious gems, banners, flags, golden thread, and strings of pearls.

source: །དངུལ་དང་། བཻ་དཱུརྱའི་ཕྱེ་མ་དང་། ཨ་ག་རུ་དང་། རྒྱ་སྤོས་དང་། དུས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ཏ་མ་ལའི་འདབ་མའི་ཆར་ཡང་རབ་ཏུ་ཕབ་བོ། །གོ་ཤིར་ཤ་དང་། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མའི་ཆར་ཡང་ལམ་དེར་ཕབ་བོ།
en: They sent showers of dust made of gold, silver, and beryl, and the powders of aloeswood, crape jasmine, white sandalwood, and benjamin, and the leaves of the tamāla tree. They sprinkled powdered gośīrṣa and uragasāra sandalwood upon the road.

source: །ལྷའི་རྒྱན་སྣ་ཚོགས་གསེར་གྱི་སྐུད་པ་དང་། མུ་ཏིག་གི་ཕྲེང་བ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དག་གིས་ཀྱང་ནམ་མཁའི་དཀྱིལ་ཐམས་ཅད་བརྒྱན་ཏོ།
en: They also adorned the entire firmament with golden thread, strings of pearls, and loose jewels and pearls, as well as various other ornaments.

source: །གྲོང་ངམ། གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་ན་ཡང་ལྷ་དང་མི་རྣམས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ལམ་མཛེས་པར་བྱེད་དོ། །གྲོང་ཁྱེར་གྱི་ནང་ན་བདུད་དམ་བདུད་ཀྱི་འཁོར་རྣམས་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བཀོད་པ་དག་བཀོད་པ་བྱས་སོ།
en: Outside the city the gods and humans decorated the road in order to worship the Blessed One, while inside, the māras and their retinues created beautiful magical displays in order to worship him.

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་བཞིན་དུ་ལམ་དུ་གཤེགས་སོ། །ཡང་དེའི་ཚེ་བཅོམ་ལྡན་འདས་སྐུའི་གཟུགས་དང་། རྟགས་དང་། སྤྱོད་ལམ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ལམ་དེར་ཞུགས་ཏེ།
en: At this time the Blessed One entered the absorption called becoming indestructible and, immersed in it, proceeded on his way down the road. He advanced on the road assuming various physical forms and features with their corresponding modes of deportment.

source: དེ་ན་སེམས་ཅན་གང་དག་ཚངས་པ་ལ་དད་ཅིང་ཚངས་པས་འདུལ་བ་དེ་དག་གིས་ནི་བཅོམ་ལྡན་འདས་ཚངས་པའི་གཟུགས་སུ་ལམ་ནས་གཤེགས་པར་མཐོང་བ་ནས།
en: Those beings who were devoted to Brahmā and capable of being guided by him saw the Blessed One walking in the form of Brahmā

source: གང་དག་བརྒྱ་བྱིན་གྱིས་འདུལ་བའི་བར་དང་། གང་དག་སྲེད་མེད་ཀྱི་བུས་འདུལ་བ་དང་། གང་དག་དབང་ཕྱུག་ཆེན་པོས་འདུལ་བ་དང་། གང་དག་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱིས་འདུལ་བ་དང་། གང་དག་འཁོར་ལོས་སྒྱུར་བས་འདུལ་བ་དང་། གང་དག་ཁམས་ཀྱི་རྒྱལ་ཕྲན་གྱིས་འདུལ་བ་དང་། གང་དག་རྫུ་འཕྲུལ་ཆེན་པོས་འདུལ་བ་དང་། གང་དག་དགེ་སྦྱོང་གིས་འདུལ་བ་དང་། གང་དག་གཞོན་ནུས་འདུལ་བ་དང་། གང་དག་བུད་མེད་ཀྱིས་འདུལ་བ་དང་། གང་དག་སེང་གེས་འདུལ་བ་དང་། གང་དག་གླང་པོ་ཆེས་འདུལ་བ་དང་། གང་དག་ཀླུས་འདུལ་བ་དང་། གང་དག་ལྷ་མ་ཡིན་གྱིས་འདུལ་བ་ནས།
en: Those who were capable of being guided by Śakra, Nārāyaṇa, Maheśvara, the Four Great Kings, a universal monarch, the master of a castle, a great sage, a monk, a princely youth, a woman, a lion, an elephant, a nāga, or an asura saw the Blessed One in that respective form.

source: གང་དག་རི་བོང་ལ་དད་ཅིང་རི་བོང་གིས་འདུལ་བའི་བར་དེ་དག་གིས། བཅོམ་ལྡན་འདས་རི་བོང་གི་གཟུགས་དང་རྟགས་དང་། སྤྱོད་ལམ་གྱིས་ལམ་ནས་གཤེགས་པར་མཐོང་ངོ་།
en: Those who were devoted to and capable of being guided by rabbits saw the Blessed One with the form and features of a rabbit, advancing on the road in the manner of a rabbit.

source: །སེམས་ཅན་གང་དག་སངས་རྒྱས་ཀྱིས་འདུལ་བ་དེ་དག་གིས་ནི། བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་གཟུགས་དང་། རྟགས་དང་། སྤྱོད་ལམ་གྱིས་ལམ་ནས་གཤེགས་པར་མཐོང་སྟེ།
en: Those capable of being guided by buddhas saw the Blessed One with the form and features of a buddha, advancing on the road in the manner of a buddha.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་ཐལ་མོ་སྦྱར་ནས་མངོན་པར་བསྟོད་ཅིང་ཕྱག་འཚལ་ཏེ། ཞབས་འབྲིང་དུ་འབྲང་ཞིང་དོང་ངོ་།
en: All these beings walked along close together with folded hands, one after the other, bowing and singing praises.
